Revit 2027 API
WallPaint.WallpaintColor Property
 The property labeled "Color" from the "WallPaint" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string WallpaintColor { get; }
Public Shared ReadOnly Property WallpaintColor As String
	Get
public:
static property String^ WallpaintColor {
	String^ get ();
}
static member WallpaintColor : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
See Also
Reference
WallPaint Class
Autodesk.Revit.DB.Visual Namespace